[
  {
    "id": "project-1",
    "slug": "legal-wires",
    "title": "Legal Wires",
    "description": "Migrated 8000+ posts from WordPress to Ghost CMS with a custom-built theme and AI chatbot integration.",
    "longDescription": "As a Freelance Front-End Developer, I developed and deployed a fully custom Ghost CMS theme using HTML, CSS, and JavaScript, specifically optimized for SEO, fast loading, and mobile responsiveness. The platform was engineered to scale for 90K+ monthly users, successfully achieving top rankings on Google Discover. I also integrated a real-time AI-powered legal assistant using REST APIs, which increased active interactions and reduced the bounce rate by 24%.",
    "thumbnailUrl": "/api/placeholder?width=600&height=400&text=Legal%20Wires&color=F9A825&textColor=FFFFFF",
    "imageUrls": [
      "/projects/wires1.png",
      "/projects/wires2.png",
      "/projects/wires3.png",
      "/projects/wires4.png",
      "/projects/wires5.png"
    ],
    "technologies": [
      "Ghost CMS",
      "JavaScript",
      "HTML5/CSS3",
      "REST APIs",
      "SEO Optimization"
    ],
    "category": ["Frontend", "CMS Development", "Freelance"],
    "githubUrl": "",
    "liveUrl": "https://legal-wires.com/",
    "featured": false,
    "startDate": "2025-01-04",
    "endDate": "2025-03-04",
    "role": "Freelance Front-End Developer",
    "challenges": [
      "Optimizing the theme structure for Google Discover visibility and high traffic",
      "Integrating dynamic AI chat features into a static content management system"
    ],
    "solutions": [
      "Developed a custom, mobile-first theme with advanced meta optimization for SEO",
      "Implemented dynamic routing and live search with external LLM integration via REST APIs"
    ]
  },
  {
    "id": "project-2",
    "slug": "lit-law",
    "title": "Lit Law",
    "description": "An AI-powered legal platform built to handle legal queries using Large Language Models (LLMs).",
    "longDescription": "Lit Law is a scalable AI-driven web platform tailored for the Indian legal ecosystem. As a Freelance Front-End Developer, I engineered the client-side architecture using Next.js and Redux, featuring a recursive Google-Drive–style document explorer and a collaborative Tiptap editor for real-time contract drafting. I optimized performance through virtualization and lazy loading to support high user concurrency, while ensuring code quality with tools like Husky and Lint-staged.",
    "thumbnailUrl": "/api/placeholder?width=600&height=400&text=Lit%20Law&color=0070F3&textColor=FFFFFF",
    "imageUrls": [
      "/projects/litLaw1.png",
      "/projects/litLaw2.png",
      "/projects/litLaw3.png"
    ],
    "technologies": [
      "Next.js",
      "Redux",
      "Tailwind CSS",
      "Framer Motion",
      "Tiptap"
    ],
    "category": ["Frontend", "Web Development", "Freelance"],
    "githubUrl": "",
    "liveUrl": "https://lit.law/",
    "featured": true,
    "startDate": "2025-03-01",
    "endDate": "2025-12-10",
    "role": "Freelance Front-End Developer",
    "challenges": [
      "Visualizing complex, nested document structures without compromising UI performance",
      "Enabling seamless real-time contract drafting and synchronization for multiple concurrent users"
    ],
    "solutions": [
      "Engineered a recursive, Google-Drive–style explorer using virtualization and lazy-loading to handle large datasets",
      "Implemented a highly optimized Tiptap editor with collaborative live sync and advanced hydration strategies"
    ]
  },
  {
    "id": "project-3",
    "slug": "portfolio",
    "title": "Personal Portfolio Website",
    "description": "A high-performance personal portfolio built with Next.js, Tailwind CSS, and Framer Motion to showcase freelance projects.",
    "longDescription": "I designed and developed this professional portfolio as a centralized hub to showcase my freelance work and technical expertise. Leveraging Next.js for server-side rendering and superior performance, I engineered a responsive, modern interface using Tailwind CSS. The user experience is elevated through complex, smooth animations and page transitions implemented with Framer Motion, ensuring a seamless journey for recruiters and clients.",
    "thumbnailUrl": "/api/placeholder?width=600&height=400&text=Four%20Paws&color=3498db&textColor=FFFFFF",
    "imageUrls": [
      "/projects/portfolio-1.png",
      "/projects/portfolio-2.png",
      "/projects/portfolio-3.png"
    ],
    "technologies": ["Next.js", "React", "Tailwind CSS", "Framer Motion"],
    "category": ["Frontend", "Web Design"],
    "githubUrl": "",
    "liveUrl": "https://dheerajsaraswat.vercel.app//",
    "featured": false,
    "startDate": "2025-01-05",
    "endDate": null,
    "role": "Front-End Developer & Designer",
    "challenges": [
      "Balancing complex animations with high-performance Core Web Vitals",
      "Creating a scalable component architecture for easy content updates"
    ],
    "solutions": [
      "Optimized Framer Motion components to ensure non-blocking main thread performance",
      "Implemented a mobile-first responsive design using Tailwind CSS utility classes"
    ]
  },
{
    "id": "project-4",
    "slug": "sheeksha-tech",
    "title": "Sheeksha Tech",
    "description": "A responsive school management SaaS architecture with a vibrant, accessible UI built using Next.js and Shadcn UI.",
    "longDescription": "In this collaborative project, I led the front-end engineering for Sheeksha Tech, a modern school management SaaS currently in the development phase. My goal was to move the platform away from traditional, rigid ERP designs by engineering a playful, pastel-themed interface using Next.js and Tailwind CSS. I utilized Shadcn UI as the core component library, extensively customizing its primitives to match the brand's 'fun and friendly' identity. The result is a highly responsive, accessible dashboard architecture designed to handle complex administrative workflows and future scalability.",
    "thumbnailUrl": "/api/placeholder?width=600&height=400&text=Sheeksha+Tech&color=FF8A65&textColor=FFFFFF",
    "imageUrls": [
      "/projects/sheeksha-1.png",
      "/projects/sheeksha-2.png",
      "/projects/sheeksha-3.png",
      "/projects/sheeksha-4.png"
    ],
    "technologies": [
      "Next.js",
      "React",
      "Shadcn UI",
      "Tailwind CSS",
      "Framer Motion",
      "TypeScript"
    ],
    "category": ["Collaboration", "SaaS Product", "UI Engineering"],
    "githubUrl": "",
    "liveUrl": "https://www.shikshatech.org/",
    "featured": false,
    "startDate": "2025-10-01",
    "endDate": null,
    "role": "Front-End Developer",
    "challenges": [
      "Heavily customizing the minimalist Shadcn UI system to support a multi-colored, vibrant pastel theme",
      "Ensuring high performance and layout stability for complex, data-heavy dashboard views"
    ],
    "solutions": [
      "Architected a scalable design token system within Tailwind CSS to override Shadcn defaults without breaking accessibility",
      "Implemented modular dashboard widgets using Next.js server components for optimal loading speeds"
    ]
}
]
